In [1]:
import numpy as np
import pandas as pd

In [2]:
def variable_correlation(variable1, variable2):
    '''
    Fill in this function to calculate the number of data points for which
    the directions of variable1 and variable2 relative to the mean are the
    same, and the number of data points for which they are different.
    Direction here means whether each value is above or below its mean.
    
    You can classify cases where the value is equal to the mean for one or
    both variables however you like.
    
    Each argument will be a Pandas series.
    
    For example, if the inputs were pd.Series([1, 2, 3, 4]) and
    pd.Series([4, 5, 6, 7]), then the output would be (4, 0).
    This is because 1 and 4 are both below their means, 2 and 5 are both
    below, 3 and 6 are both above, and 4 and 7 are both above.
    
    On the other hand, if the inputs were pd.Series([1, 2, 3, 4]) and
    pd.Series([7, 6, 5, 4]), then the output would be (0, 4).
    This is because 1 is below its mean but 7 is above its mean, and
    so on.
    '''
    
    mean1 = variable1.mean()
    mean2 = variable2.mean()
    
    is_same_direction = (variable1 < mean1 & variable2 < mean2) | (variable1 > mean1 & variable2 > mean2)
    num_same_direction = is_same_direction.sum()
    
    num_different_direction = len(variable1) - num_same_direction
    
    return (num_same_direction, num_different_direction)

In [3]:
variable1 = pd.Series([1,2,3,4])
variable2 = pd.Series([1,2,3,4])

In [4]:
test1 = variable1 < variable1.mean()

In [5]:
test2 = variable2 < variable2.mean()

In [6]:
test1 & test2

0     True
1     True
2    False
3    False
dtype: bool

In [7]:
test3 = test1 | test2

In [8]:
test3.sum()

2

In [9]:
import pandas as pd

names = pd.Series([
    'Andre Agassi',
    'Barry Bonds',
    'Christopher Columbus',
    'Daniel Defoe',
    'Emilio Estevez',
    'Fred Flintstone',
    'Greta Garbo',
    'Humbert Humbert',
    'Ivan Ilych',
    'James Joyce',
    'Keira Knightley',
    'Lois Lane',
    'Mike Myers',
    'Nick Nolte',
    'Ozzy Osbourne',
    'Pablo Picasso',
    'Quirinus Quirrell',
    'Rachael Ray',
    'Susan Sarandon',
    'Tina Turner',
    'Ugueth Urbina',
    'Vince Vaughn',
    'Woodrow Wilson',
    'Yoji Yamada',
    'Zinedine Zidane'
])

def reverse_names(names):
    '''
    Fill in this function to return a new series where each name
    in the input series has been transformed from the format
    "Firstname Lastname" to "Lastname, FirstName".
    
    Try to use the Pandas apply() function rather than a loop.
    '''
    
    seperate_name = names.split(' ')
    first = seperate_name[0]
    last = seperate_name[1]
    new_name = last + ', ' + first
    
    return new_name

In [10]:
names.apply(reverse_names)

0             Agassi, Andre
1              Bonds, Barry
2     Columbus, Christopher
3             Defoe, Daniel
4           Estevez, Emilio
5          Flintstone, Fred
6              Garbo, Greta
7          Humbert, Humbert
8               Ilych, Ivan
9              Joyce, James
10         Knightley, Keira
11               Lane, Lois
12              Myers, Mike
13              Nolte, Nick
14           Osbourne, Ozzy
15           Picasso, Pablo
16       Quirrell, Quirinus
17             Ray, Rachael
18          Sarandon, Susan
19             Turner, Tina
20           Urbina, Ugueth
21            Vaughn, Vince
22          Wilson, Woodrow
23             Yamada, Yoji
24         Zidane, Zinedine
dtype: object

In [11]:
import numpy as np

# Subway ridership for 5 stations on 10 different days
ridership = np.array([
    [   0,    0,    2,    5,    0],
    [1478, 3877, 3674, 2328, 2539],
    [1613, 4088, 3991, 6461, 2691],
    [1560, 3392, 3826, 4787, 2613],
    [1608, 4802, 3932, 4477, 2705],
    [1576, 3933, 3909, 4979, 2685],
    [  95,  229,  255,  496,  201],
    [   2,    0,    1,   27,    0],
    [1438, 3785, 3589, 4174, 2215],
    [1342, 4043, 4009, 4665, 3033]
])

ridership

array([[   0,    0,    2,    5,    0],
       [1478, 3877, 3674, 2328, 2539],
       [1613, 4088, 3991, 6461, 2691],
       [1560, 3392, 3826, 4787, 2613],
       [1608, 4802, 3932, 4477, 2705],
       [1576, 3933, 3909, 4979, 2685],
       [  95,  229,  255,  496,  201],
       [   2,    0,    1,   27,    0],
       [1438, 3785, 3589, 4174, 2215],
       [1342, 4043, 4009, 4665, 3033]])

In [12]:
def mean_riders_for_max_station(ridership):
    '''
    Fill in this function to find the station with the maximum riders on the
    first day, then return the mean riders per day for that station. Also
    return the mean ridership overall for comparsion.
    
    Hint: NumPy's argmax() function might be useful:
    http://docs.scipy.org/doc/numpy/reference/generated/numpy.argmax.html
    '''
    max_riders_on_first = ridership[0].argmax()
    overall_mean = ridership.mean()  # Replace this with your code
    mean_for_max = ridership[:, max_riders_on_first].mean() # Replace this with your code
    
    return (overall_mean, mean_for_max)

In [13]:
mean_riders_for_max_station(ridership)

(2342.5999999999999, 3239.9000000000001)

In [14]:
np.max(ridership)

6461

In [15]:
np.mean(ridership)

2342.5999999999999

In [16]:
ridership.mean()

2342.5999999999999

In [17]:
ridership = np.array([
    [   0,    0,    2,    5,    0],
    [1478, 3877, 3674, 2328, 2539],
    [1613, 4088, 3991, 6461, 2691],
    [1560, 3392, 3826, 4787, 2613],
    [1608, 4802, 3932, 4477, 2705],
    [1576, 3933, 3909, 4979, 2685],
    [  95,  229,  255,  496,  201],
    [   2,    0,    1,   27,    0],
    [1438, 3785, 3589, 4174, 2215],
    [1342, 4043, 4009, 4665, 3033]
])

ridership

array([[   0,    0,    2,    5,    0],
       [1478, 3877, 3674, 2328, 2539],
       [1613, 4088, 3991, 6461, 2691],
       [1560, 3392, 3826, 4787, 2613],
       [1608, 4802, 3932, 4477, 2705],
       [1576, 3933, 3909, 4979, 2685],
       [  95,  229,  255,  496,  201],
       [   2,    0,    1,   27,    0],
       [1438, 3785, 3589, 4174, 2215],
       [1342, 4043, 4009, 4665, 3033]])

In [18]:
def min_and_max_riders_per_day(ridership):
    '''
    Fill in this function. First, for each subway station, calculate the
    mean ridership per day. Then, out of all the subway stations, return the
    maximum and minimum of these values. That is, find the maximum
    mean-ridership-per-day and the minimum mean-ridership-per-day for any
    subway station.
    '''
    
    mean_rider_per_station = ridership.mean(axis = 0)
    
    max_daily_ridership = mean_rider_per_station.max()    # Replace this with your code
    min_daily_ridership = mean_rider_per_station.min()   # Replace this with your code
    
    return (max_daily_ridership, min_daily_ridership)

In [19]:
min_and_max_riders_per_day(ridership)

(3239.9000000000001, 1071.2)

In [20]:
import pandas as pd

# Subway ridership for 5 stations on 10 different days
ridership_df = pd.DataFrame(
    data=[[   0,    0,    2,    5,    0],
          [1478, 3877, 3674, 2328, 2539],
          [1613, 4088, 3991, 6461, 2691],
          [1560, 3392, 3826, 4787, 2613],
          [1608, 4802, 3932, 4477, 2705],
          [1576, 3933, 3909, 4979, 2685],
          [  95,  229,  255,  496,  201],
          [   2,    0,    1,   27,    0],
          [1438, 3785, 3589, 4174, 2215],
          [1342, 4043, 4009, 4665, 3033]],
    index=['05-01-11', '05-02-11', '05-03-11', '05-04-11', '05-05-11',
           '05-06-11', '05-07-11', '05-08-11', '05-09-11', '05-10-11'],
    columns=['R003', 'R004', 'R005', 'R006', 'R007']
)

ridership_df

          R003  R004  R005  R006  R007
05-01-11     0     0     2     5     0
05-02-11  1478  3877  3674  2328  2539
05-03-11  1613  4088  3991  6461  2691
05-04-11  1560  3392  3826  4787  2613
05-05-11  1608  4802  3932  4477  2705
05-06-11  1576  3933  3909  4979  2685
05-07-11    95   229   255   496   201
05-08-11     2     0     1    27     0
05-09-11  1438  3785  3589  4174  2215
05-10-11  1342  4043  4009  4665  3033

In [21]:
def mean_riders_for_max_station(ridership):
    '''
    Fill in this function to find the station with the maximum riders on the
    first day, then return the mean riders per day for that station. Also
    return the mean ridership overall for comparsion.
    
    This is the same as a previous exercise, but this time the
    input is a Pandas DataFrame rather than a 2D NumPy array.
    '''
        
    overall_mean = ridership.values.mean() # Replace this with your code
    mean_for_max = ridership.mean().max() # Replace this with your code
    
    return (overall_mean, mean_for_max)

In [22]:
mean_riders_for_max_station(ridership_df)

(2342.5999999999999, 3239.9000000000001)

In [23]:
ridership_df.shift?

In [24]:
ridership_df

          R003  R004  R005  R006  R007
05-01-11     0     0     2     5     0
05-02-11  1478  3877  3674  2328  2539
05-03-11  1613  4088  3991  6461  2691
05-04-11  1560  3392  3826  4787  2613
05-05-11  1608  4802  3932  4477  2705
05-06-11  1576  3933  3909  4979  2685
05-07-11    95   229   255   496   201
05-08-11     2     0     1    27     0
05-09-11  1438  3785  3589  4174  2215
05-10-11  1342  4043  4009  4665  3033

In [25]:
import pandas as pd

# --- Quiz ---
# Cumulative entries and exits for one station for a few hours.
entries_and_exits = pd.DataFrame({
    'ENTRIESn': [3144312, 3144335, 3144353, 3144424, 3144594,
                 3144808, 3144895, 3144905, 3144941, 3145094],
    'EXITSn': [1088151, 1088159, 1088177, 1088231, 1088275,
               1088317, 1088328, 1088331, 1088420, 1088753]
})

entries_and_exits

   ENTRIESn   EXITSn
0   3144312  1088151
1   3144335  1088159
2   3144353  1088177
3   3144424  1088231
4   3144594  1088275
5   3144808  1088317
6   3144895  1088328
7   3144905  1088331
8   3144941  1088420
9   3145094  1088753

In [26]:
def get_hourly_entries_and_exits(entries_and_exits):
    '''
    Fill in this function to take a DataFrame with cumulative entries
    and exits (entries in the first column, exits in the second) and
    return a DataFrame with hourly entries and exits (entries in the
    first column, exits in the second).
    '''
    
    new_entries_and_exits = entries_and_exits.shift()
    print(new_entries_and_exits)
    hourly_data = entries_and_exits - new_entries_and_exits
    
    return hourly_data

In [27]:
get_hourly_entries_and_exits(entries_and_exits)

    ENTRIESn     EXITSn
0        NaN        NaN
1  3144312.0  1088151.0
2  3144335.0  1088159.0
3  3144353.0  1088177.0
4  3144424.0  1088231.0
5  3144594.0  1088275.0
6  3144808.0  1088317.0
7  3144895.0  1088328.0
8  3144905.0  1088331.0
9  3144941.0  1088420.0

   ENTRIESn  EXITSn
0       NaN     NaN
1      23.0     8.0
2      18.0    18.0
3      71.0    54.0
4     170.0    44.0
5     214.0    42.0
6      87.0    11.0
7      10.0     3.0
8      36.0    89.0
9     153.0   333.0

In [28]:
grades_df = pd.DataFrame(
    data={'exam1': [43, 81, 78, 75, 89, 70, 91, 65, 98, 87],
          'exam2': [24, 63, 56, 56, 67, 51, 79, 46, 72, 60]},
    index=['Andre', 'Barry', 'Chris', 'Dan', 'Emilio', 
           'Fred', 'Greta', 'Humbert', 'Ivan', 'James']
)

grades_df

         exam1  exam2
Andre       43     24
Barry       81     63
Chris       78     56
Dan         75     56
Emilio      89     67
Fred        70     51
Greta       91     79
Humbert     65     46
Ivan        98     72
James       87     60

In [29]:
def convert_grade(grade):
    if 90 <= grade <= 100:
        grade = 'A'
    elif 80 <= grade < 90:
        grade = 'B'
    elif 70 <= grade < 80:
        grade = 'C'
    elif 60 <= grade < 70:
        grade = 'D'
    else:
        grade = 'F'
        
    return grade

In [30]:
def convert_grades(grades):
    '''
    Fill in this function to convert the given DataFrame of numerical
    grades to letter grades. Return a new DataFrame with the converted
    grade.
    
    The conversion rule is:
        90-100 -> A
        80-89  -> B
        70-79  -> C
        60-69  -> D
        0-59   -> F
    '''
    df_grades = grades.applymap(convert_grade)
    
    return df_grades

In [31]:
convert_grades(grades_df)

        exam1 exam2
Andre       F     F
Barry       B     D
Chris       C     F
Dan         C     F
Emilio      B     D
Fred        C     F
Greta       A     C
Humbert     D     F
Ivan        A     C
James       B     D

In [32]:
import pandas as pd

grades_df = pd.DataFrame(
    data={'exam1': [43, 81, 78, 75, 89, 70, 91, 65, 98, 87],
          'exam2': [24, 63, 56, 56, 67, 51, 79, 46, 72, 60]},
    index=['Andre', 'Barry', 'Chris', 'Dan', 'Emilio', 
           'Fred', 'Greta', 'Humbert', 'Ivan', 'James']
)

grades_df

         exam1  exam2
Andre       43     24
Barry       81     63
Chris       78     56
Dan         75     56
Emilio      89     67
Fred        70     51
Greta       91     79
Humbert     65     46
Ivan        98     72
James       87     60

In [33]:
grades_df.iloc[0]

exam1    43
exam2    24
Name: Andre, dtype: int64

In [34]:
grades_df.loc['Andre']

exam1    43
exam2    24
Name: Andre, dtype: int64

In [35]:
grades_df['exam1']

Andre      43
Barry      81
Chris      78
Dan        75
Emilio     89
Fred       70
Greta      91
Humbert    65
Ivan       98
James      87
Name: exam1, dtype: int64

In [36]:
def standardize_col(grades):
    mean = grades.mean()
    std = grades.std()
    standardize = (grades - mean) / std
    
    return standardize

In [37]:
def standardize(df):
    '''
    Fill in this function to standardize each column of the given
    DataFrame. To standardize a variable, convert each value to the
    number of standard deviations it is above or below the mean.
    '''
    standardize = df.apply(standardize_col)
    
    return standardize

In [38]:
standardize_col(grades_df['exam1'])

Andre     -2.196525
Barry      0.208891
Chris      0.018990
Dan       -0.170911
Emilio     0.715295
Fred      -0.487413
Greta      0.841896
Humbert   -0.803916
Ivan       1.284999
James      0.588694
Name: exam1, dtype: float64

In [39]:
standardize(grades_df)

            exam1     exam2
Andre   -2.196525 -2.186335
Barry    0.208891  0.366571
Chris    0.018990 -0.091643
Dan     -0.170911 -0.091643
Emilio   0.715295  0.628408
Fred    -0.487413 -0.418938
Greta    0.841896  1.413917
Humbert -0.803916 -0.746234
Ivan     1.284999  0.955703
James    0.588694  0.170194

In [40]:
import numpy as np
import pandas as pd

df = pd.DataFrame({
    'a': [4, 5, 3, 1, 2],
    'b': [20, 10, 40, 50, 30],
    'c': [25, 20, 5, 15, 10]
})

df

   a   b   c
0  4  20  25
1  5  10  20
2  3  40   5
3  1  50  15
4  2  30  10

In [41]:
def second_largest_per_column(series):
    
    sorted_series = series.sort_values(ascending = False)
    print(sorted_series)
    return sorted_series.iloc[1]

In [42]:
def second_largest(df):
    '''
    Fill in this function to return the second-largest value of each 
    column of the input DataFrame.
    '''
    
    return df.apply(second_largest_per_column)

In [43]:
second_largest_per_column(df['a'])

1    5
0    4
2    3
4    2
3    1
Name: a, dtype: int64

4

In [44]:
df.apply(second_largest_per_column)

1    5
0    4
2    3
4    2
3    1
Name: a, dtype: int64
3    50
2    40
4    30
0    20
1    10
Name: b, dtype: int64
0    25
1    20
3    15
4    10
2     5
Name: c, dtype: int64

a     4
b    40
c    20
dtype: int64

In [45]:
list(grades_df.columns)

for col in list(grades_df.columns):
    print(grades_df[col])

Andre      43
Barry      81
Chris      78
Dan        75
Emilio     89
Fred       70
Greta      91
Humbert    65
Ivan       98
James      87
Name: exam1, dtype: int64
Andre      24
Barry      63
Chris      56
Dan        56
Emilio     67
Fred       51
Greta      79
Humbert    46
Ivan       72
James      60
Name: exam2, dtype: int64

In [46]:
grades_df = pd.DataFrame(
    data={'exam1': [43, 81, 78, 75, 89, 70, 91, 65, 98, 87],
          'exam2': [24, 63, 56, 56, 67, 51, 79, 46, 72, 60]},
    index=['Andre', 'Barry', 'Chris', 'Dan', 'Emilio', 
           'Fred', 'Greta', 'Humbert', 'Ivan', 'James']
)

grades_df

         exam1  exam2
Andre       43     24
Barry       81     63
Chris       78     56
Dan         75     56
Emilio      89     67
Fred        70     51
Greta       91     79
Humbert     65     46
Ivan        98     72
James       87     60

In [47]:
grades_df.index

Index(['Andre', 'Barry', 'Chris', 'Dan', 'Emilio', 'Fred', 'Greta', 'Humbert',
       'Ivan', 'James'],
      dtype='object')

In [48]:
new_df = pd.DataFrame(0, columns = list(grades_df.columns), index = list(grades_df.index))
new_df

         exam1  exam2
Andre        0      0
Barry        0      0
Chris        0      0
Dan          0      0
Emilio       0      0
Fred         0      0
Greta        0      0
Humbert      0      0
Ivan         0      0
James        0      0

In [49]:
s = pd.Series([1,2], index = list(new_df.columns))
s

exam1    1
exam2    2
dtype: int64

In [50]:
new_df.add(s, axis = 'columns')

         exam1  exam2
Andre        1      2
Barry        1      2
Chris        1      2
Dan          1      2
Emilio       1      2
Fred         1      2
Greta        1      2
Humbert      1      2
Ivan         1      2
James        1      2

In [51]:
s = pd.Series(1, index = list(grades_df.columns))
s

exam1    1
exam2    1
dtype: int64

In [52]:
for col in list(grades_df.columns):
    mean = grades_df[col].mean()
    std = grades_df[col].std(ddof = 0)
    s = (grades_df[col] - mean) / std
    print(s)

Andre     -2.315341
Barry      0.220191
Chris      0.020017
Dan       -0.180156
Emilio     0.753987
Fred      -0.513779
Greta      0.887436
Humbert   -0.847401
Ivan       1.354508
James      0.620538
Name: exam1, dtype: float64
Andre     -2.304599
Barry      0.386400
Chris     -0.096600
Dan       -0.096600
Emilio     0.662400
Fred      -0.441600
Greta      1.490400
Humbert   -0.786600
Ivan       1.007400
James      0.179400
Name: exam2, dtype: float64

In [53]:
new_df + s

,Andre,Barry,Chris,Dan,Emilio,Fred,Greta,Humbert,Ivan,James,exam1,exam2
Andre,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Barry,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Chris,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Dan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Emilio,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Fred,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Greta,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Humbert,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Ivan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
James,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [102]:
def standardize(df):
    '''
    Fill in this function to standardize each column of the given
    DataFrame. To standardize a variable, convert each value to the
    number of standard deviations it is above or below the mean.
    
    This time, try to use vectorized operations instead of apply().
    You should get the same results as you did before.
    '''
    new_df = pd.DataFrame(0, columns = list(df.columns), index = list(df.index))
    print(type(new_df))
    print(new_df.shape)
    print(new_df)
    
    for col in df:
        mean = df[col].mean()
        std = df[col].std(ddof = 0)
        s = (df[col] - mean) / std
        print(s.shape)
        print(type(s))
        print(s)
        new_df = new_df.add(s, axis = 'index')

    return new_df

In [103]:
standardize(grades_df)

<class 'pandas.core.frame.DataFrame'>
(10, 2)
         exam1  exam2
Andre        0      0
Barry        0      0
Chris        0      0
Dan          0      0
Emilio       0      0
Fred         0      0
Greta        0      0
Humbert      0      0
Ivan         0      0
James        0      0
(10,)
<class 'pandas.core.series.Series'>
Andre     -2.315341
Barry      0.220191
Chris      0.020017
Dan       -0.180156
Emilio     0.753987
Fred      -0.513779
Greta      0.887436
Humbert   -0.847401
Ivan       1.354508
James      0.620538
Name: exam1, dtype: float64
(10,)
<class 'pandas.core.series.Series'>
Andre     -2.304599
Barry      0.386400
Chris     -0.096600
Dan       -0.096600
Emilio     0.662400
Fred      -0.441600
Greta      1.490400
Humbert   -0.786600
Ivan       1.007400
James      0.179400
Name: exam2, dtype: float64

            exam1     exam2
Andre   -4.619940 -4.619940
Barry    0.606591  0.606591
Chris   -0.076583 -0.076583
Dan     -0.276756 -0.276756
Emilio   1.416387  1.416387
Fred    -0.955379 -0.955379
Greta    2.377836  2.377836
Humbert -1.634001 -1.634001
Ivan     2.361908  2.361908
James    0.799938  0.799938

In [56]:
grades_df

         exam1  exam2
Andre       43     24
Barry       81     63
Chris       78     56
Dan         75     56
Emilio      89     67
Fred        70     51
Greta       91     79
Humbert     65     46
Ivan        98     72
James       87     60

In [57]:
grades_df.mean()

exam1    77.7
exam2    57.4
dtype: float64

In [58]:
(grades_df - grades_df.mean()) / grades_df.std(ddof = 0)

            exam1     exam2
Andre   -2.315341 -2.304599
Barry    0.220191  0.386400
Chris    0.020017 -0.096600
Dan     -0.180156 -0.096600
Emilio   0.753987  0.662400
Fred    -0.513779 -0.441600
Greta    0.887436  1.490400
Humbert -0.847401 -0.786600
Ivan     1.354508  1.007400
James    0.620538  0.179400

In [59]:
def standardize(df):
    '''
    Fill in this function to standardize each column of the given
    DataFrame. To standardize a variable, convert each value to the
    number of standard deviations it is above or below the mean.
    
    This time, try to use vectorized operations instead of apply().
    You should get the same results as you did before.
    '''
    
    mean = df.mean()
    std = df.std(ddof = 0)
    standard = (df - mean) / std
    
    return standard

In [60]:
standardize(grades_df)

            exam1     exam2
Andre   -2.315341 -2.304599
Barry    0.220191  0.386400
Chris    0.020017 -0.096600
Dan     -0.180156 -0.096600
Emilio   0.753987  0.662400
Fred    -0.513779 -0.441600
Greta    0.887436  1.490400
Humbert -0.847401 -0.786600
Ivan     1.354508  1.007400
James    0.620538  0.179400

In [61]:
grades_df.mean(axis = 'columns')

Andre      33.5
Barry      72.0
Chris      67.0
Dan        65.5
Emilio     78.0
Fred       60.5
Greta      85.0
Humbert    55.5
Ivan       85.0
James      73.5
dtype: float64

In [62]:
grades_df.std(axis = 1)

Andre      13.435029
Barry      12.727922
Chris      15.556349
Dan        13.435029
Emilio     15.556349
Fred       13.435029
Greta       8.485281
Humbert    13.435029
Ivan       18.384776
James      19.091883
dtype: float64

In [63]:
def standardize_rows(df):
    '''
    Optional: Fill in this function to standardize each row of the given
    DataFrame. Again, try not to use apply().
    
    This one is more challenging than standardizing each column!
    '''
    mean = df.mean(axis = 'columns')
    std = df.std(axis = 'columns')
    diff = df.sub(mean, axis = 'index')
    standardize_row = diff.div(std, axis = 'index')
    
    return standardize_row

In [64]:
standardize_rows(grades_df)

            exam1     exam2
Andre    0.707107 -0.707107
Barry    0.707107 -0.707107
Chris    0.707107 -0.707107
Dan      0.707107 -0.707107
Emilio   0.707107 -0.707107
Fred     0.707107 -0.707107
Greta    0.707107 -0.707107
Humbert  0.707107 -0.707107
Ivan     0.707107 -0.707107
James    0.707107 -0.707107

In [65]:
values = np.array([1, 3, 2, 4, 1, 6, 4])
example_df = pd.DataFrame({
    'value': values,
    'even': values % 2 == 0,
    'above_three': values > 3 
}, index=['a', 'b', 'c', 'd', 'e', 'f', 'g'])

example_df

  above_three   even  value
a       False  False      1
b       False  False      3
c       False   True      2
d        True   True      4
e       False  False      1
f        True   True      6
g        True   True      4

In [66]:
example_df.groupby(['even', 'above_three']).mean()['value']

even   above_three
False  False          1.666667
True   False          2.000000
       True           4.666667
Name: value, dtype: float64

In [67]:
ridership_df = pd.DataFrame({
    'UNIT': ['R051', 'R079', 'R051', 'R079', 'R051', 'R079', 'R051', 'R079', 'R051'],
    'TIMEn': ['00:00:00', '02:00:00', '04:00:00', '06:00:00', '08:00:00', '10:00:00', '12:00:00', '14:00:00', '16:00:00'],
    'ENTRIESn': [3144312, 8936644, 3144335, 8936658, 3144353, 8936687, 3144424, 8936819, 3144594],
    'EXITSn': [1088151, 13755385,  1088159, 13755393,  1088177, 13755598, 1088231, 13756191,  1088275]
})

ridership_df

   ENTRIESn    EXITSn     TIMEn  UNIT
0   3144312   1088151  00:00:00  R051
1   8936644  13755385  02:00:00  R079
2   3144335   1088159  04:00:00  R051
3   8936658  13755393  06:00:00  R079
4   3144353   1088177  08:00:00  R051
5   8936687  13755598  10:00:00  R079
6   3144424   1088231  12:00:00  R051
7   8936819  13756191  14:00:00  R079
8   3144594   1088275  16:00:00  R051

In [68]:
ridership_entry = ridership_df.groupby('UNIT')['ENTRIESn']

In [69]:
ridership_entry

In [70]:
ridership_exit = ridership_df.groupby(['UNIT', 'TIMEn']).sum()['EXITSn']

In [71]:
ridership_exit

UNIT  TIMEn
R051  00:00:00     1088151
      04:00:00     1088159
      08:00:00     1088177
      12:00:00     1088231
      16:00:00     1088275
R079  02:00:00    13755385
      06:00:00    13755393
      10:00:00    13755598
      14:00:00    13756191
Name: EXITSn, dtype: int64

In [72]:
new_ridership_exit = ridership_exit.shift()

In [73]:
new_ridership_exit

UNIT  TIMEn
R051  00:00:00           NaN
      04:00:00     1088151.0
      08:00:00     1088159.0
      12:00:00     1088177.0
      16:00:00     1088231.0
R079  02:00:00     1088275.0
      06:00:00    13755385.0
      10:00:00    13755393.0
      14:00:00    13755598.0
Name: EXITSn, dtype: float64

In [74]:
def hourly_group(df):
    df_entry = df.groupby(['UNIT', 'TIMEn']).sum()['ENTRIESn']
    df_exit = df.groupby(['UNIT', 'TIMEn']).sum()['EXITSn']
    
    new_df_entry = df_entry.shift()
    new_df_exit = df_exit.shift()
    
    hourly_entry = df_entry - new_df_entry
    hourly_exit = df_exit - new_df_exit
    
    return hourly_entry, hourly_exit

In [75]:
hourly_group(ridership_df)

(UNIT  TIMEn
 R051  00:00:00          NaN
       04:00:00         23.0
       08:00:00         18.0
       12:00:00         71.0
       16:00:00        170.0
 R079  02:00:00    5792050.0
       06:00:00         14.0
       10:00:00         29.0
       14:00:00        132.0
 Name: ENTRIESn, dtype: float64, UNIT  TIMEn
 R051  00:00:00           NaN
       04:00:00           8.0
       08:00:00          18.0
       12:00:00          54.0
       16:00:00          44.0
 R079  02:00:00    12667110.0
       06:00:00           8.0
       10:00:00         205.0
       14:00:00         593.0
 Name: EXITSn, dtype: float64)

In [110]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], index = ['a', 'b', 'c'], columns = ['x', 'y', 'z'])

In [111]:
df

   x  y  z
a  1  2  3
b  4  5  6
c  7  8  9

In [113]:
df.drop(['x'], axis = 1)

   y  z
a  2  3
b  5  6
c  8  9

In [114]:
df

   x  y  z
a  1  2  3
b  4  5  6
c  7  8  9